tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"

brew "bash"
brew "docker-compose"
brew "exa"
brew "grep"
brew "mas"
brew "moreutils"
brew "nvm"
brew "ruby"
brew "shellcheck"
brew "tldr"
brew "tree"
brew "unzip"
brew "wget"
brew "youtube-dl"

cask "appcleaner"
cask "balenaetcher"
cask "calibre"
cask "clover-configurator"
cask "contexts"
cask "cyberduck"
cask "discord"
cask "docker"
cask "downie"
cask "firefox"
cask "firefox-developer-edition"
cask "font-fira-code"
cask "google-chrome"
cask "google-chrome-canary"
cask "iina"
cask "iterm2"
cask "nativedisplaybrightness"
cask "nightowl"
cask "notion"
cask "pocket-casts"
cask "postman"
cask "sensiblesidebuttons"
cask "skype"
cask "slack"
cask "spotify"
cask "telegram"
cask "ticktick"
cask "transmission"
cask "typora"
cask "virtualbox"
cask "visual-studio-code"
cask "xmind-zen"

mas "Magnet", id: 441258766
mas "MiniPlay", id: 936243210
mas "Pixelmator", id: 407963104
mas "Tweetbot", id: 1384080005
mas "Xcode", id: 497799835
