alefragnani.Bookmarks
christian-kohler.path-intellisense
dbaeumer.vscode-eslint
dsznajder.es7-react-js-snippets
eamodio.gitlens
eg2.vscode-npm-script
esbenp.prettier-vscode
file-icons.file-icons
letrieu.expand-region
miguelsolorio.min-theme
ms-azuretools.vscode-docker
ms-vscode-remote.remote-containers
ms-vscode.vscode-typescript-tslint-plugin
msjsdiag.debugger-for-chrome
sleistner.vscode-fileutils
VisualStudioExptTeam.vscodeintellicode
WakaTime.vscode-wakatime
wix.glean
yzhang.markdown-all-in-one
